{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}, "outputs": {"conv1d_transpose_4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16384"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/concat/values_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "25"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/concat/values_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "25"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/concat/values_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "25"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/concat/values_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "25"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/concat/values_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "25"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "16384"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, {"name": "StatefulPartitionedCall/WG_Generator/dense/MatMul", "op": "MatMul", "input": ["input_1", "StatefulPartitionedCall/WG_Generator/dense/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/leaky_re_lu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/WG_Generator/dense/MatMul"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/reshape/Shape", "StatefulPartitionedCall/WG_Generator/reshape/strided_slice/stack", "StatefulPartitionedCall/WG_Generator/reshape/strided_slice/stack_1", "StatefulPartitionedCall/WG_Generator/reshape/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/WG_Generator/reshape/strided_slice", "StatefulPartitionedCall/WG_Generator/reshape/Reshape/shape/1", "StatefulPartitionedCall/WG_Generator/reshape/Reshape/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu/LeakyRelu", "StatefulPartitionedCall/WG_Generator/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/WG_Generator/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/reshape/Reshape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32"}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/mul", "op": "Mul", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/mul", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/stack/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/concat/values_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/concat", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ExpandDims_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/ExpandDims"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose/conv1d_transpose/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32"}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/mul", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/stack/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/concat/values_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/concat", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ExpandDims_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/WG_Generator/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_1/conv1d_transpose/Squeeze"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_2/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice"], "attr": {"value": {"tensor": {"dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/mul", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/stack/2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/concat/values_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/concat", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ExpandDims_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/ExpandDims"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_2/conv1d_transpose/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_3/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32"}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/mul", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/stack/2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/concat/values_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/concat", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ExpandDims_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/ExpandDims"], "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_3/conv1d_transpose/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_4/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/Shape", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32"}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "op": "ExpandDims", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/mul", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/stack/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/concat/values_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/strided_slice_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/concat", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ExpandDims_1", "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/ExpandDims"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}}}, {"name": "StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/WG_Generator/conv1d_transpose_4/conv1d_transpose"], "attr": {"squeeze_dims": 